In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3')
conlt = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3')
conmy = engine.connect()
engine = create_engine(
    "postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development"
)
conpg = engine.connect()

year = 2022
quarter = 1
today = date.today()
today_str = today.strftime('%Y-%m-%d')
today_str

'2022-04-20'

In [2]:
#today = date(2022, 3, 11)
today_str = today.strftime("%Y-%m-%d")
today_str

'2022-04-20'

In [3]:
format_dict = {'q_amt':'{:,}','y_amt':'{:,}','yoy_gain':'{:,}',
               'q_amt_c':'{:,}','q_amt_p':'{:,}',
               'aq_amt':'{:,}','ay_amt':'{:,}','acc_gain':'{:,}',
               'latest_amt':'{:,}','previous_amt':'{:,}','inc_amt':'{:,}',
               'latest_amt_q':'{:,}','previous_amt_q':'{:,}','inc_amt_q':'{:,}',
               'latest_amt_y':'{:,}','previous_amt_y':'{:,}','inc_amt_y':'{:,}',
               'inc_pct':'{:.2f}','inc_pct_q':'{:.2f}','inc_pct_y':'{:.2f}'}

### Process for specified stocks

In [ ]:
names = ('TCAP','TCAP')
sql = """
SELECT name,year,quarter,q_amt,y_amt,aq_amt,ay_amt 
FROM epss 
WHERE year = %s AND quarter = %s
AND name IN %s
"""
sql = sql % (year, quarter, names)
epss = pd.read_sql(sql, conlt)
epss.style.format(format_dict)

### End of Process for specified stocks

In [4]:
sql = """
SELECT name,year,quarter,q_amt,y_amt,aq_amt,ay_amt 
FROM epss 
WHERE year = %s AND quarter = %s
AND publish_date = '%s'"""
sql = sql % (year, quarter, today_str)
epss = pd.read_sql(sql, conlt)
epss.head().style.format(format_dict)

### End of Normal Process

In [5]:
strqtr = "Q" + str(quarter)
strqtr

'Q1'

In [6]:
sql = '''
SELECT name, year, quarter, latest_amt, previous_amt, inc_amt, inc_pct 
FROM qt_profits 
WHERE year = %s AND quarter = "Q%s"
'''
sql = sql % (year, quarter)
qt_pf = pd.read_sql(sql, conlt)
qt_pf.sort_values(['inc_pct'],ascending=[False]).shape[0]

13

In [7]:
df_merge = pd.merge(epss, qt_pf, on=['name'], suffixes=(['_e','_q']), how='inner')
df_merge.head().sort_values(['inc_pct'],ascending=[False]).style.format(format_dict)

### Delete duplicated year and quarter

In [8]:
columns = ['year_q','quarter_q']
epssqt_pf = df_merge.drop(columns, axis='columns')
epssqt_pf.head().style.format(format_dict)

In [9]:
sql = '''
SELECT name, year, quarter, latest_amt, previous_amt, inc_amt, inc_pct 
FROM yr_profits 
WHERE year = %s AND quarter = "Q%s"'''
sql = sql % (year, quarter)
yr_pf = pd.read_sql(sql, conlt)
yr_pf.tail().sort_values(['inc_pct'],ascending=[False]).style.format(format_dict)

In [10]:
df_merge2 = pd.merge(epssqt_pf, yr_pf, on=['name'], suffixes=(['_q','_y']), how='inner')
df_merge2.tail().style.format(format_dict)

### Delete duplicated year and quarter

In [11]:
columns = ['year_e','quarter_e']
profits = df_merge2.drop(columns, axis='columns')
profits.head().style.format(format_dict)

### Filter criteria
1. Current yearly profit amount > 440 millions
2. Previous yearly profit amount > 400 millions
3. Yearly gain percent >= 10 percent

In [12]:
cols = 'name latest_amt_y previous_amt_y inc_amt_y inc_pct_y'.split()

In [14]:
profits[profits['name'] == 'BAY'].style.format(format_dict)

In [15]:
criteria_1 = profits.latest_amt_y > 440000
profits.loc[criteria_1,cols].sort_values(['latest_amt_y'],ascending=[False]).style.format(format_dict)

In [16]:
criteria_2 = profits.previous_amt_y > 400000
profits.loc[criteria_2,cols].sort_values(['previous_amt_y'],ascending=[False]).style.format(format_dict)

In [17]:
criteria_3 = profits.inc_pct_y > 10
profits.loc[criteria_3,cols].sort_values(['inc_pct_y'],ascending=[False]).style.format(format_dict)

In [18]:
# NO CRITERIA-2
profits_criteria = criteria_1 & criteria_2 & criteria_3
#profits_criteria = criteria_1 & criteria_2
filter = profits.loc[profits_criteria]
filter.sort_values(['inc_pct_y'],ascending=[False]).style.format(format_dict)

In [19]:
columns = 'year quarter q_amt y_amt aq_amt ay_amt'.split()
#pre_final0 = filter.loc[[38,44,39,36,43,37,35],:]
#pre_final = pre_final0.drop(columns, axis=1)
pre_final = filter.drop(columns, axis=1)
pre_final.sort_values(['name'],ascending=[True]).style.format(format_dict)

In [20]:
final = pre_final.loc[:,:]
final.style.format(format_dict)

In [21]:
final.sort_values(['name'], ascending=True).style.format(format_dict)

In [22]:
sql = '''
SELECT A.name,A.year,A.quarter,A.q_amt AS q_amt_c,A.y_amt,B.q_amt AS q_amt_p 
FROM epss A JOIN epss B ON a.name = B.name 
WHERE A.year = %s AND A.quarter = %s 
AND B.year = (%s-1) AND B.quarter = 4'''
sql = sql % (year, quarter, year)
print(sql)

SELECT A.name,A.year,A.quarter,A.q_amt AS q_amt_c,A.y_amt,B.q_amt AS q_amt_p
FROM epss A JOIN epss B ON a.name = B.name
WHERE A.year = 2022 AND A.quarter = 1
AND B.year = (2022-1) AND B.quarter = 4

In [23]:
epss2 = pd.read_sql(sql, conlt)
epss2.shape[0]

13

In [24]:
df_merge3 = pd.merge(final, epss2, on=['name'], suffixes=(['_f','_e']), how='inner')
df_merge3.style.format(format_dict)

In [25]:
final2 = df_merge3[['name','year','quarter',\
'latest_amt_y','previous_amt_y','inc_amt_y','inc_pct_y',\
'latest_amt_q','previous_amt_q','inc_amt_q','inc_pct_q',\
'q_amt_c', 'y_amt', 'q_amt_p']]               
final2.style.format(format_dict)

In [26]:
def better(vals):
    current, previous = vals
    if current > previous:
        return 1
    else:
        return 0

In [27]:
final2['kind'] = final2[['q_amt_c', 'q_amt_p']].apply(better, axis=1)

C:\Users\User\AppData\Local\Temp/ipykernel_7988/170999467.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2['kind'] = final2[['q_amt_c', 'q_amt_p']].apply(better, axis=1)

In [28]:
final2.kind.value_counts()

1    3
Name: kind, dtype: int64

In [29]:
final2['inc_amt_py'] = (final2['q_amt_c']-final2['y_amt'])
final2['inc_pct_py'] = (final2['inc_amt_py']/abs(final2['y_amt'])*100)

final2['inc_amt_pq'] = (final2['q_amt_c']-final2['q_amt_p'])
final2['inc_pct_pq'] = (final2['inc_amt_pq']/abs(final2['q_amt_p'])*100)

C:\Users\User\AppData\Local\Temp/ipykernel_7988/553347636.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2['inc_amt_py'] = (final2['q_amt_c']-final2['y_amt'])
C:\Users\User\AppData\Local\Temp/ipykernel_7988/553347636.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2['inc_pct_py'] = (final2['inc_amt_py']/abs(final2['y_amt'])*100)
C:\Users\User\AppData\Local\Temp/ipykernel_7988/553347636.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2['inc_amt_pq'] = (final2['q_amt_c']-final2['q_amt_p'])
C:\Users\User\AppData\Local\Temp/ipykernel_7988/553347636.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2['inc_pct_pq'] = (final2['inc_amt_pq']/abs(final2['q_amt_p'])*100)

In [30]:
import numpy as np
final2['inc_pct_py'].replace('inf', np.nan, inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\generic.py:6619: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return self._update_inplace(result)

In [31]:
final2['mean_pct'] = final2[['inc_pct_y','inc_pct_q','inc_pct_py','inc_pct_pq']].mean(axis=1, skipna=True)

C:\Users\User\AppData\Local\Temp/ipykernel_7988/462442401.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2['mean_pct'] = final2[['inc_pct_y','inc_pct_q','inc_pct_py','inc_pct_pq']].mean(axis=1, skipna=True)

In [32]:
final2[['name','mean_pct']].sort_values(['mean_pct'], ascending=False)

  name   mean_pct
0  BAY  21.773949
1  KTC  15.350669
2  TTB  14.403686

In [33]:
final2['std_pct'] = final2[['inc_pct_y','inc_pct_q','inc_pct_py','inc_pct_pq']].std(axis=1)

C:\Users\User\AppData\Local\Temp/ipykernel_7988/714542820.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2['std_pct'] = final2[['inc_pct_y','inc_pct_q','inc_pct_py','inc_pct_pq']].std(axis=1)

In [34]:
final2[['name','std_pct']].sort_values(['std_pct'], ascending=True)

  name    std_pct
2  TTB   8.480781
1  KTC  16.997625
0  BAY  22.393089

In [35]:
sql = 'SELECT name, id FROM tickers'
tickers = pd.read_sql(sql, conlt)

df_merge4 = pd.merge(final2, tickers, on='name', how='inner')
df_merge4.rename(columns={"id":"ticker_id"}, inplace = True)

final3 = df_merge4[['name','year','quarter','kind',\
                    'latest_amt_y','previous_amt_y','inc_amt_y','inc_pct_y',\
                    'latest_amt_q','previous_amt_q','inc_amt_q','inc_pct_q',\
                    'q_amt_c','y_amt','inc_amt_py','inc_pct_py',\
                    'q_amt_p','inc_amt_pq','inc_pct_pq','ticker_id','mean_pct','std_pct']]

rcds = final3.values.tolist()
rcds

[['BAY',
  2022,
  1,
  1,
  34707618,
  22512053,
  12195565,
  54.17,
  34707618,
  33794188,
  913430,
  2.7,
  7418285,
  6504855,
  913430,
  14.04228072724142,
  6384972,
  1033313,
  16.183516544786727,
  49,
  21.773949318007038,
  22.393088816012593],
 ['KTC',
  2022,
  1,
  1,
  5992158,
  5325531,
  666627,
  12.52,
  5992158,
  5878692,
  113466,
  1.93,
  1747272,
  1633806,
  113466,
  6.9448881935798985,
  1247982,
  499290,
  40.00778857387366,
  259,
  15.350669191863389,
  16.997624736425244],
 ['TTB',
  2022,
  1,
  1,
  10886994,
  8730675,
  2156319,
  24.7,
  10886994,
  10474045,
  412949,
  3.94,
  3194904,
  2781955,
  412949,
  14.84384183065506,
  2799333,
  395571,
  14.130901896987606,
  541,
  14.403685931910665,
  8.480781312577827]]

In [36]:
final3.sort_values(['name'],ascending=[True])

,name,year,quarter,kind,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y,latest_amt_q,previous_amt_q,...,q_amt_c,y_amt,inc_amt_py,inc_pct_py,q_amt_p,inc_amt_pq,inc_pct_pq,ticker_id,mean_pct,std_pct
0,BAY,2022,1,1,34707618,22512053,12195565,54.17,34707618,33794188,...,7418285,6504855,913430,14.042281,6384972,1033313,16.183517,49,21.773949,22.393089
1,KTC,2022,1,1,5992158,5325531,666627,12.52,5992158,5878692,...,1747272,1633806,113466,6.944888,1247982,499290,40.007789,259,15.350669,16.997625
2,TTB,2022,1,1,10886994,8730675,2156319,24.70,10886994,10474045,...,3194904,2781955,412949,14.843842,2799333,395571,14.130902,541,14.403686,8.480781

In [37]:
sr = final3['name']
names = sr.values.tolist()
names

['BAY', 'KTC', 'TTB']

In [38]:
names = sr.values.tolist()
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

"'BAY', 'KTC', 'TTB'"

In [39]:
sql = """
DELETE FROM profits
WHERE name IN (%s)
AND year = %s AND quarter = %s
"""
sql = sql % (in_p, year, quarter)
print(sql)

DELETE FROM profits
WHERE name IN ('BAY', 'KTC', 'TTB')
AND year = 2022 AND quarter = 1

In [40]:
rp = conlt.execute(sql)
rp.rowcount

0

In [41]:
for rcd in rcds:
    print(rcd)

['BAY', 2022, 1, 1, 34707618, 22512053, 12195565, 54.17, 34707618, 33794188, 913430, 2.7, 7418285, 6504855, 913430, 14.04228072724142, 6384972, 1033313, 16.183516544786727, 49, 21.773949318007038, 22.393088816012593]
['KTC', 2022, 1, 1, 5992158, 5325531, 666627, 12.52, 5992158, 5878692, 113466, 1.93, 1747272, 1633806, 113466, 6.9448881935798985, 1247982, 499290, 40.00778857387366, 259, 15.350669191863389, 16.997624736425244]
['TTB', 2022, 1, 1, 10886994, 8730675, 2156319, 24.7, 10886994, 10474045, 412949, 3.94, 3194904, 2781955, 412949, 14.84384183065506, 2799333, 395571, 14.130901896987606, 541, 14.403685931910665, 8.480781312577827]

In [42]:
sql = """
INSERT INTO profits (name, year, quarter, kind,
latest_amt_y, previous_amt_y, inc_amt_y, inc_pct_y,
latest_amt_q, previous_amt_q, inc_amt_q, inc_pct_q,
q_amt_c, y_amt, inc_amt_py, inc_pct_py,
q_amt_p, inc_amt_pq, inc_pct_pq,
ticker_id, mean_pct, std_pct)
VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
"""
print(sql)

INSERT INTO profits (name, year, quarter, kind,
latest_amt_y, previous_amt_y, inc_amt_y, inc_pct_y,
latest_amt_q, previous_amt_q, inc_amt_q, inc_pct_q,
q_amt_c, y_amt, inc_amt_py, inc_pct_py,
q_amt_p, inc_amt_pq, inc_pct_pq,
ticker_id, mean_pct, std_pct)
VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

In [43]:
for rcd in rcds:
    conlt.execute(sql, rcd)

### End of Create Data

### Insert Profits from PortLt to PortMy

In [44]:
print(final3.name)

0    BAY
1    KTC
2    TTB
Name: name, dtype: object

In [45]:
sr = final3['name']
names = sr.values.tolist()
names

['BAY', 'KTC', 'TTB']

In [46]:
in_p = ', '.join(map(lambda name: "'%s'" % name, names))
in_p

"'BAY', 'KTC', 'TTB'"

In [47]:
sql = """
SELECT * 
FROM profits 
WHERE name IN (%s) AND year = %s AND quarter = %s"""
sql = sql % (in_p, year, quarter)
print(sql)

SELECT *
FROM profits
WHERE name IN ('BAY', 'KTC', 'TTB') AND year = 2022 AND quarter = 1

In [48]:
profits_inp = pd.read_sql(sql, conlt)
profits_inp.sort_values(by=['kind','name'],ascending=[True,True])

,id,name,year,quarter,kind,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y,latest_amt_q,...,q_amt_c,y_amt,inc_amt_py,inc_pct_py,q_amt_p,inc_amt_pq,inc_pct_pq,ticker_id,mean_pct,std_pct
0,2349,BAY,2022,1,1,34707618,22512053,12195565,54.17,34707618,...,7418285,6504855,913430,14.042281,6384972,1033313,16.183517,49,21.773949,22.393089
1,2350,KTC,2022,1,1,5992158,5325531,666627,12.52,5992158,...,1747272,1633806,113466,6.944888,1247982,499290,40.007789,259,15.350669,16.997625
2,2351,TTB,2022,1,1,10886994,8730675,2156319,24.70,10886994,...,3194904,2781955,412949,14.843842,2799333,395571,14.130902,541,14.403686,8.480781

In [49]:
rcds = profits_inp.values.tolist()
len(rcds)

3

In [50]:
for rcd in rcds:
    print(rcd)

[2349, 'BAY', 2022, 1, 1, 34707618, 22512053, 12195565, 54.17, 34707618, 33794188, 913430, 2.7, 7418285, 6504855, 913430, 14.04228072724142, 6384972, 1033313, 16.183516544786727, 49, 21.773949318007038, 22.393088816012593]
[2350, 'KTC', 2022, 1, 1, 5992158, 5325531, 666627, 12.52, 5992158, 5878692, 113466, 1.93, 1747272, 1633806, 113466, 6.9448881935798985, 1247982, 499290, 40.00778857387366, 259, 15.350669191863389, 16.997624736425244]
[2351, 'TTB', 2022, 1, 1, 10886994, 8730675, 2156319, 24.7, 10886994, 10474045, 412949, 3.94, 3194904, 2781955, 412949, 14.84384183065506, 2799333, 395571, 14.130901896987606, 541, 14.403685931910665, 8.480781312577827]

In [51]:
sql = """
INSERT INTO profits (id, name, year, quarter, kind,
latest_amt_y, previous_amt_y, inc_amt_y, inc_pct_y,
latest_amt_q, previous_amt_q, inc_amt_q, inc_pct_q,
q_amt_c, y_amt, inc_amt_py, inc_pct_py,
q_amt_p, inc_amt_pq, inc_pct_pq,
ticker_id, mean_pct, std_pct)
VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
"""
print(sql)

INSERT INTO profits (id, name, year, quarter, kind,
latest_amt_y, previous_amt_y, inc_amt_y, inc_pct_y,
latest_amt_q, previous_amt_q, inc_amt_q, inc_pct_q,
q_amt_c, y_amt, inc_amt_py, inc_pct_py,
q_amt_p, inc_amt_pq, inc_pct_pq,
ticker_id, mean_pct, std_pct)
VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

In [52]:
for rcd in rcds:
    conmy.execute(sql, rcd)

In [53]:
sql = '''
SELECT name, year, quarter 
FROM profits
ORDER BY name
'''
df_tmp = pd.read_sql(sql, conmy)
df_tmp.set_index('name', inplace=True)
df_tmp.index

Index(['AMATA', 'ASIAN', 'ASK', 'ASP', 'BAM', 'BAY', 'BBL', 'BCH', 'BDMS',
       'CHG', 'COM7', 'DOHOME', 'EA', 'GLOBAL', 'GULF', 'JMART', 'JMT', 'KCE',
       'KKP', 'KTC', 'MAKRO', 'MCS', 'MEGA', 'NER', 'ORI', 'PTL', 'PTT',
       'PTTEP', 'RATCH', 'RCL', 'RJH', 'SCB', 'SCC', 'SCCC', 'SENA', 'SINGER',
       'SIS', 'SMPC', 'SNC', 'SPALI', 'STARK', 'SVI', 'SYNEX', 'TISCO', 'TMT',
       'TPIPL', 'TQM', 'TTB', 'TU', 'VIBHA'],
      dtype='object', name='name')

### After call 150-Export-to-PortPg

In [54]:
sql = """
SELECT * 
FROM profits 
WHERE name IN (%s) AND year = %s AND quarter = %s"""
sql = sql % (in_p, year, quarter)
print(sql)

SELECT *
FROM profits
WHERE name IN ('BAY', 'KTC', 'TTB') AND year = 2022 AND quarter = 1

In [55]:
profits_inp = pd.read_sql(sql, conpg)
profits_inp[['name','ticker_id']].sort_values(by=[ "name"], ascending=[True])

  name  ticker_id
2  BAY         53
1  KTC        266
0  TTB        549

In [56]:
sql = """
SELECT * 
FROM tickers
WHERE name IN (%s)
ORDER BY name"""
sql = sql % in_p
print(sql)

SELECT *
FROM tickers
WHERE name IN ('BAY', 'KTC', 'TTB')
ORDER BY name

In [57]:
tickers = pd.read_sql(sql, conpg)
tickers[['name','id','market']].sort_values(by=[ "name"], ascending=[True])

  name   id                   market
0  BAY   53                      SET
1  KTC  266          SET50 / SETTHSI
2  TTB  549  SET50 / SETHD / SETTHSI